# Project: Data Science Jobs Analysis 

## Project Task: Data Wrangling

## Table of Contents
<ul>
<li><a href="#intro">Introduction</a></li>
<li><a href="#wrangling">Data Wrangling</a></li>
<li><a href="#summary">Conclusions</a></li>
</ul>

<a id='intro'></a>
## Introduction

### Project Context
Project Goal: The aim of the project is to clean the dataset using python
### Dataset Description 
In this project, I will work on the Data Science Job dataset gotten from the [Kaggle](https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries). 
The dataset contains 607 records (rows) and 12 fields (columns) and the column description are as follows 

- **work_year:**	The year the salary was paid.
- **experience_level:**	The experience level in the job during the year with the following possible values: EN Entry-level / Junior MI Mid-level / Intermediate SE Senior-level / Expert EX Executive-level / Director
- **employment_type:**	The type of employement for the role: PT Part-time FT Full-time CT Contract FL Freelance
- **job_title:**  The role worked in during the year.
- **salary:**	The total gross salary amount paid.
- **salary_currency:**	The currency of the salary paid as an ISO 4217 currency code.
- **salaryinusd:**	The salary in USD (FX rate divided by avg. USD rate for the respective year via fxdata.foorilla.com).
- **employee_residence:**	Employee's primary country of residence in during the work year as an ISO 3166 country code.
- **remote_ratio:**	The overall amount of work done remotely, possible values are as follows: 0 No remote work (less than 20%) 50 Partially remote 100 Fully remote (more than 80%)
- **company_location:**	The country of the employer's main office or contracting branch as an ISO 3166 country code.
- **company_size:**	The average number of people that worked for the company during the year: S less than 50 employees (small) M 50 to 250 employees (medium) L more than 250 employees (large)



For the Data CLeaning, Python with the aid of some of its packages, which would be imported

In [65]:
# importing python packages
import pandas as pd
import os

<a id='wrangling'></a>
## Data Wrangling

The Data Wrangling Process would be done in three iterative steps
1. **Data Gathering**
2. **Assessing Data**
3. **Data Cleaning**

## Data Gathering
In the cell below, I will be gathering the Data Science jobs dataset from the [Kaggle](https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries) website amd importing it to my Jupyter Notebook and reading it into a dataframe for cleaning

In [2]:
# reading the file to a dataframe
data_df = pd.read_csv('ds_salaries.csv')
data_df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [3]:
# to confirm the number of rows and columns of the data 
data_df.shape

(607, 12)

This confirms that the data has 607 rows and 12 columns

## Assessing Data
In this section, I will be assessing the data visually and programmatically for issues with tidiness and quality

In [4]:
# to check the first few rows of the data
data_df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

Checking the datatypes of the data

In [5]:
# to check data types
data_df.dtypes

Unnamed: 0             int64
work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

To check for duplicate records

In [7]:
sum(data_df.duplicated())

0

To check for columns with null values

In [12]:
data_df.columns[data_df.isna().any()]

Index([], dtype='object')

To check for information about the data

In [13]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

To check the descriptive statistics of the data

In [14]:
data_df.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

.

### Quality issues Observed from the Data

- first column has no name
- the first column should have an increment of 1
- the use of MI, EN, SE and EX for experiecne levels
- the use pf PT, FT, FL and CT for Employment type
- the use of L, M and S for company size 
- the use of country codes for employee residence and company locations
- the datatype of work_year, remote ratio, experience level and company_size should be changed

### Cleaning Data

This will be done using the define-code-test framework. Before commencing with cleaning the tables, copies of the tables are created

In [22]:
data_df_clean = data_df.copy()

.

### First Column has no name

#### Define

The first column of the data has an invalid column name which would be changed

#### Code

In [23]:
# to check the columns names
data_df_clean.columns

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [29]:
# to change the column name
data_df_clean.rename(columns = {'Unnamed: 0' : 'row_number'}, inplace = True)

#### Test

In [30]:
# to test if the code worked
data_df_clean.columns

Index(['row_number', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

### Increment by 1 in the first column

#### Define
Increase the values in the first column by one

#### Code

In [33]:
# to check the minimum value
data_df_clean.row_number.min()

0

In [34]:
# to check the maximum value
data_df_clean.row_number.max()

606

In [35]:
# to increase the values by 1
data_df_clean['row_number'] = data_df_clean.row_number.apply(lambda x: x+1)

#### Test

In [36]:
# toc heck if the code worked
data_df_clean.row_number.values

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143,
       144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156,
       157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169,
       170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182,
       183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195,
       196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208,
       209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221,
       222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234,
       235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247,
       248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260,
       261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273,
       274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286,
       287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299,
       300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312,
       313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325,
       326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338,
       339, 340, 341, 342, 343, 344, 345, 346, 347, 348, 349, 350, 351,
       352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364,
       365, 366, 367, 368, 369, 370, 371, 372, 373, 374, 375, 376, 377,
       378, 379, 380, 381, 382, 383, 384, 385, 386, 387, 388, 389, 390,
       391, 392, 393, 394, 395, 396, 397, 398, 399, 400, 401, 402, 403,
       404, 405, 406, 407, 408, 409, 410, 411, 412, 413, 414, 415, 416,
       417, 418, 419, 420, 421, 422, 423, 424, 425, 426, 427, 428, 429,
       430, 431, 432, 433, 434, 435, 436, 437, 438, 439, 440, 441, 442,
       443, 444, 445, 446, 447, 448, 449, 450, 451, 452, 453, 454, 455,
       456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468,
       469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481,
       482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494,
       495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507,
       508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520,
       521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533,
       534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546,
       547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 558, 559,
       560, 561, 562, 563, 564, 565, 566, 567, 568, 569, 570, 571, 572,
       573, 574, 575, 576, 577, 578, 579, 580, 581, 582, 583, 584, 585,
       586, 587, 588, 589, 590, 591, 592, 593, 594, 595, 596, 597, 598,
       599, 600, 601, 602, 603, 604, 605, 606, 607], dtype=int64)

### The use of MI, EN, SE and EX in Experience level

#### Define
The use of short words in experiecne level instead of the full name for clarity 

#### Code

In [37]:
# to check the unique values in the experience level column
data_df_clean['experience_level'].unique()

array(['MI', 'SE', 'EN', 'EX'], dtype=object)

In [41]:
# to change the short strings to their full meaning
data_df_clean['experience_level'] = data_df_clean['experience_level'].replace(['MI', 'SE', 'EN', 'EX'],
                                                ['Mid level', 'Senior level', 'Entry level', 'Executive level'])

#### Test

In [39]:
# to test if the code worked
data_df_clean['experience_level'].unique()

array(['Mid level', 'Senior level', 'Entry level', 'Executive level'],
      dtype=object)

### The use of FT, PT, FL & CT in Employment Type

#### Define
The use of short words in employment type instead of the full name for clarity 

#### Code

In [42]:
# to check the unique values in the employment type column
data_df_clean['employment_type'].unique()

array(['FT', 'CT', 'PT', 'FL'], dtype=object)

In [43]:
# to change the short strings to their full meaning
data_df_clean['employment_type'] = data_df_clean['employment_type'].replace(['FT', 'CT', 'PT', 'FL'],
                                                ['Full-time', 'Contract', 'Part-time', 'Freelance'])

#### Test

In [44]:
# to test if the changes have been made
data_df_clean['employment_type'].unique()

array(['Full-time', 'Contract', 'Part-time', 'Freelance'], dtype=object)

### The use of Country Codes

#### Define
The use of short codes for country instead of the full country name in the employee residence and company location

#### Code

In [48]:
# to check the country code used in employee residence
data_df_clean['employee_residence'].unique()

array(['DE', 'JP', 'GB', 'HN', 'US', 'HU', 'NZ', 'FR', 'IN', 'PK', 'PL',
       'PT', 'CN', 'GR', 'AE', 'NL', 'MX', 'CA', 'AT', 'NG', 'PH', 'ES',
       'DK', 'RU', 'IT', 'HR', 'BG', 'SG', 'BR', 'IQ', 'VN', 'BE', 'UA',
       'MT', 'CL', 'RO', 'IR', 'CO', 'MD', 'KE', 'SI', 'HK', 'TR', 'RS',
       'PR', 'LU', 'JE', 'CZ', 'AR', 'DZ', 'TN', 'MY', 'EE', 'AU', 'BO',
       'IE', 'CH'], dtype=object)

In [49]:
# to check the country code used in company location
data_df_clean['company_location'].unique()

array(['DE', 'JP', 'GB', 'HN', 'US', 'HU', 'NZ', 'FR', 'IN', 'PK', 'CN',
       'GR', 'AE', 'NL', 'MX', 'CA', 'AT', 'NG', 'ES', 'PT', 'DK', 'IT',
       'HR', 'LU', 'PL', 'SG', 'RO', 'IQ', 'BR', 'BE', 'UA', 'IL', 'RU',
       'MT', 'CL', 'IR', 'CO', 'MD', 'KE', 'SI', 'CH', 'VN', 'AS', 'TR',
       'CZ', 'DZ', 'EE', 'MY', 'AU', 'IE'], dtype=object)

In [51]:
country_code = {'Afghanistan': 'AF',
'Albania': 'AL',
'Algeria': 'DZ',
'American Samoa': 'AS',
'Andorra': 'AD',
'Angola': 'AO',
'Anguilla': 'AI',
'Antarctica': 'AQ',
'Antigua and Barbuda': 'AG',
'Argentina': 'AR',
'Armenia': 'AM',
'Aruba': 'AW',
'Australia': 'AU',
'Austria': 'AT',
'Azerbaijan': 'AZ',
'Bahamas': 'BS',
'Bahrain': 'BH',
'Bangladesh': 'BD',
'Barbados': 'BB',
'Belarus': 'BY',
'Belgium': 'BE',
'Belize': 'BZ',
'Benin': 'BJ',
'Bermuda': 'BM',
'Bhutan': 'BT',
'Bolivia': 'BO',
'Bonaire, Sint Eustatius and Saba': 'BQ',
'Bosnia and Herzegovina': 'BA',
'Botswana': 'BW',
'Bouvet Island': 'BV',
'Brazil': 'BR',
'British Indian Ocean Territory': 'IO',
'Brunei Darussalam': 'BN',
'Bulgaria': 'BG',
'Burkina Faso': 'BF',
'Burundi': 'BI',
'Cambodia': 'KH',
'Cameroon': 'CM',
'Canada': 'CA',
'Cape Verde': 'CV',
'Cayman Islands': 'KY',
'Central African Republic': 'CF',
'Chad': 'TD',
'Chile': 'CL',
'China': 'CN',
'Christmas Island': 'CX',
'Cocos (Keeling) Islands': 'CC',
'Colombia': 'CO',
'Comoros': 'KM',
'Congo': 'CG',
'Congo, the Democratic Republic of the': 'CD',
'Cook Islands': 'CK',
'Costa Rica': 'CR',
'Country name': 'Code',
'Croatia': 'HR',
'Cuba': 'CU',
'Curaçao': 'CW',
'Cyprus': 'CY',
'Czech Republic': 'CZ',
"Côte d'Ivoire": 'CI',
'Denmark': 'DK',
'Djibouti': 'DJ',
'Dominica': 'DM',
'Dominican Republic': 'DO',
'Ecuador': 'EC',
'Egypt': 'EG',
'El Salvador': 'SV',
'Equatorial Guinea': 'GQ',
'Eritrea': 'ER',
'Estonia': 'EE',
'Ethiopia': 'ET',
'Falkland Islands (Malvinas)': 'FK',
'Faroe Islands': 'FO',
'Fiji': 'FJ',
'Finland': 'FI',
'France': 'FR',
'French Guiana': 'GF',
'French Polynesia': 'PF',
'French Southern Territories': 'TF',
'Gabon': 'GA',
'Gambia': 'GM',
'Georgia': 'GE',
'Germany': 'DE',
'Ghana': 'GH',
'Gibraltar': 'GI',
'Greece': 'GR',
'Greenland': 'GL',
'Grenada': 'GD',
'Guadeloupe': 'GP',
'Guam': 'GU',
'Guatemala': 'GT',
'Guernsey': 'GG',
'Guinea': 'GN',
'Guinea-Bissau': 'GW',
'Guyana': 'GY',
'Haiti': 'HT',
'Heard Island and McDonald Islands': 'HM',
'Holy See (Vatican City State)': 'VA',
'Honduras': 'HN',
'Hong Kong': 'HK',
'Hungary': 'HU',
'ISO 3166-2:GB': '(.uk)',
'Iceland': 'IS',
'India': 'IN',
'Indonesia': 'ID',
'Iran': 'IR',
'Iraq': 'IQ',
'Ireland': 'IE',
'Isle of Man': 'IM',
'Israel': 'IL',
'Italy': 'IT',
'Jamaica': 'JM',
'Japan': 'JP',
'Jersey': 'JE',
'Jordan': 'JO',
'Kazakhstan': 'KZ',
'Kenya': 'KE',
'Kiribati': 'KI',
"Korea, Democratic People's Republic of": 'KP',
'Korea, Republic of': 'KR',
'Kuwait': 'KW',
'Kyrgyzstan': 'KG',
"Lao People's Democratic Republic": 'LA',
'Latvia': 'LV',
'Lebanon': 'LB',
'Lesotho': 'LS',
'Liberia': 'LR',
'Libya': 'LY',
'Liechtenstein': 'LI',
'Lithuania': 'LT',
'Luxembourg': 'LU',
'Macao': 'MO',
'Macedonia, the former Yugoslav Republic of': 'MK',
'Madagascar': 'MG',
'Malawi': 'MW',
'Malaysia': 'MY',
'Maldives': 'MV',
'Mali': 'ML',
'Malta': 'MT',
'Marshall Islands': 'MH',
'Martinique': 'MQ',
'Mauritania': 'MR',
'Mauritius': 'MU',
'Mayotte': 'YT',
'Mexico': 'MX',
'Micronesia, Federated States of': 'FM',
'Moldova': 'MD',
'Monaco': 'MC',
'Mongolia': 'MN',
'Montenegro': 'ME',
'Montserrat': 'MS',
'Morocco': 'MA',
'Mozambique': 'MZ',
'Myanmar': 'MM',
'Namibia': 'NA',
'Nauru': 'NR',
'Nepal': 'NP',
'Netherlands': 'NL',
'New Caledonia': 'NC',
'New Zealand': 'NZ',
'Nicaragua': 'NI',
'Niger': 'NE',
'Nigeria': 'NG',
'Niue': 'NU',
'Norfolk Island': 'NF',
'Northern Mariana Islands': 'MP',
'Norway': 'NO',
'Oman': 'OM',
'Pakistan': 'PK',
'Palau': 'PW',
'Palestine, State of': 'PS',
'Panama': 'PA',
'Papua New Guinea': 'PG',
'Paraguay': 'PY',
'Peru': 'PE',
'Philippines': 'PH',
'Pitcairn': 'PN',
'Poland': 'PL',
'Portugal': 'PT',
'Puerto Rico': 'PR',
'Qatar': 'QA',
'Romania': 'RO',
'Russia': 'RU',
'Rwanda': 'RW',
'Réunion': 'RE',
'Saint Barthélemy': 'BL',
'Saint Helena, Ascension and Tristan da Cunha': 'SH',
'Saint Kitts and Nevis': 'KN',
'Saint Lucia': 'LC',
'Saint Martin (French part)': 'MF',
'Saint Pierre and Miquelon': 'PM',
'Saint Vincent and the Grenadines': 'VC',
'Samoa': 'WS',
'San Marino': 'SM',
'Sao Tome and Principe': 'ST',
'Saudi Arabia': 'SA',
'Senegal': 'SN',
'Serbia': 'RS',
'Seychelles': 'SC',
'Sierra Leone': 'SL',
'Singapore': 'SG',
'Sint Maarten (Dutch part)': 'SX',
'Slovakia': 'SK',
'Slovenia': 'SI',
'Solomon Islands': 'SB',
'Somalia': 'SO',
'South Africa': 'ZA',
'South Georgia and the South Sandwich Islands': 'GS',
'South Sudan': 'SS',
'Spain': 'ES',
'Sri Lanka': 'LK',
'Sudan': 'SD',
'Suriname': 'SR',
'Svalbard and Jan Mayen': 'SJ',
'Swaziland': 'SZ',
'Sweden': 'SE',
'Switzerland': 'CH',
'Syrian Arab Republic': 'SY',
'Taiwan, Province of China': 'TW',
'Tajikistan': 'TJ',
'Tanzania, United Republic of': 'TZ',
'Thailand': 'TH',
'Timor-Leste': 'TL',
'Togo': 'TG',
'Tokelau': 'TK',
'Tonga': 'TO',
'Trinidad and Tobago': 'TT',
'Tunisia': 'TN',
'Turkey': 'TR',
'Turkmenistan': 'TM',
'Turks and Caicos Islands': 'TC',
'Tuvalu': 'TV',
'Uganda': 'UG',
'Ukraine': 'UA',
'United Arab Emirates': 'AE',
'United Kingdom': 'GB',
'United States': 'US',
'United States Minor Outlying Islands': 'UM',
'Uruguay': 'UY',
'Uzbekistan': 'UZ',
'Vanuatu': 'VU',
'Venezuela': 'VE',
'Vietnam': 'VN',
'Virgin Islands, British': 'VG',
'Virgin Islands, U.S.': 'VI',
'Wallis and Futuna': 'WF',
'Western Sahara': 'EH',
'Yemen': 'YE',
'Zambia': 'ZM',
'Zimbabwe': 'ZW',
'Åland Islands': 'AX'}


for keys, values in country_code.items():
    data_df_clean['company_location'].replace(values, keys, inplace=True)
    data_df_clean['employee_residence'].replace(values, keys, inplace=True)

#### Test

In [52]:
data_df['company_location'].unique()

array(['Germany', 'Japan', 'United Kingdom', 'Honduras', 'United States',
       'Hungary', 'New Zealand', 'France', 'India', 'Pakistan', 'China',
       'Greece', 'United Arab Emirates', 'Netherlands', 'Mexico',
       'Canada', 'Austria', 'Nigeria', 'Spain', 'Portugal', 'Denmark',
       'Italy', 'Croatia', 'Luxembourg', 'Poland', 'Singapore', 'Romania',
       'Iraq', 'Brazil', 'Belgium', 'Ukraine', 'Israel', 'Russia',
       'Malta', 'Chile', 'Iran', 'Colombia', 'Moldova', 'Kenya',
       'Slovenia', 'Switzerland', 'Vietnam', 'American Samoa', 'Turkey',
       'Czech Republic', 'Algeria', 'Estonia', 'Malaysia', 'Australia',
       'Ireland'], dtype=object)

In [53]:
data_df['employee_residence'].unique()

array(['Germany', 'Japan', 'United Kingdom', 'Honduras', 'United States',
       'Hungary', 'New Zealand', 'France', 'India', 'Pakistan', 'Poland',
       'Portugal', 'China', 'Greece', 'United Arab Emirates',
       'Netherlands', 'Mexico', 'Canada', 'Austria', 'Nigeria',
       'Philippines', 'Spain', 'Denmark', 'Russia', 'Italy', 'Croatia',
       'Bulgaria', 'Singapore', 'Brazil', 'Iraq', 'Vietnam', 'Belgium',
       'Ukraine', 'Malta', 'Chile', 'Romania', 'Iran', 'Colombia',
       'Moldova', 'Kenya', 'Slovenia', 'Hong Kong', 'Turkey', 'Serbia',
       'Puerto Rico', 'Luxembourg', 'Jersey', 'Czech Republic',
       'Argentina', 'Algeria', 'Tunisia', 'Malaysia', 'Estonia',
       'Australia', 'Bolivia', 'Ireland', 'Switzerland'], dtype=object)

### Changing DataTypes

#### Define
The datatype of the work_year, remote_ratio, experience level and company size would be changed

#### Code

In [54]:
#to check all the columns of the data
data_df_clean.columns

Index(['row_number', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [55]:
# to check their datatypes
data_df_clean[['work_year', 'experience_level', 'remote_ratio', 'company_size']].dtypes

work_year            int64
experience_level    object
remote_ratio         int64
company_size        object
dtype: object

In [56]:
# to change their datatypes

# to change the work year to datetime 
data_df_clean['work_year'] = pd.to_datetime(data_df_clean['work_year'], format = "%Y")

# to change the remaining columns to category datatype
columns = ['experience_level', 'remote_ratio', 'company_size']
for col in columns:
    data_df_clean[col] = data_df_clean[col].astype('category')

#### Test

In [57]:
# to confirm if the code worked
data_df_clean[['work_year', 'experience_level', 'remote_ratio', 'company_size']].dtypes

work_year           datetime64[ns]
experience_level          category
remote_ratio              category
company_size              category
dtype: object

### The use of L, M & S in company size

#### Define
The use of short words in company size instead of the full name for clarity 

#### Code

In [58]:
# to check the unique values in the company size column
data_df_clean['company_size'].unique()

['L', 'S', 'M']
Categories (3, object): ['L', 'M', 'S']

In [61]:
# to change the short strings to their full meaning
data_df_clean['company_size'] = data_df_clean['company_size'].replace(['L', 'S', 'M'],
                                                ['Large', 'Small', 'Medium'])

#### Test

In [62]:
# to see if the code works
data_df_clean['company_size'].unique()

array(['Large', 'Small', 'Medium'], dtype=object)

.

### Storing the Data

Since the cleaning stage is done, I would save the cleaned data to a file

In [63]:
# saving the cleaned table to a file 
data_df_clean.to_csv('cleaned_ds_salaries.csv', index = False)

#### Test

In [64]:
# to check if the file was saved/ it exist locally
os.path.exists('cleaned_ds_salaries.csv')

True